from dataclasses import dataclass

from models.tag import Tag


@dataclass
class TagsCategory:
    id: str
    name: str
    description: str
    tags: list[Tag]


default_categories: list[TagsCategory] = [
    TagsCategory("world-characteristics", "Xаракстеристика мира", "Описание категории Xаракстеристика мира", [
        Tag(1, "Суперсилы", "В сказке у героев есть суперсилы, например, они умеют летать или видеть в темноте."),
        Tag(2, "Волшебство", "Эта категория для историй, в которых происходят волшебные события, например, превращения или исполнение желаний."),
        Tag(3, "Реалистичность", "В эту категорию можно отнести сказки, которые больше похожи на обычные истории, без волшебства и суперсил."),
    ]),
    TagsCategory("setting", "Сеттинг", "Описание категории Сеттинг", [
        Tag(4, "Путешествия по разным мирам", ""),
        Tag(5, "Космос", ""),
        Tag(6, "Зима", ""),
        Tag(7, "Постапокалипсис", ""),
        Tag(8, "Средневековье", ""),
        Tag(9, "Фэнтази", ""),
    ]),
    TagsCategory("character", "Персонажи", "Описание категории Персонажи", [
        Tag(10, "Рыцарь", ""),
        Tag(11, "Магические существа", ""),
        Tag(12, "Роботы", ""),
        Tag(13, "Гномы", ""),
        Tag(14, "Волки", ""),
        Tag(15, "Феи", ""),
        Tag(16, "Богатыри", ""),
        Tag(17, "Медведи", ""),
        Tag(18, "Ведьма", ""),
        Tag(19, "Кот", ""),
        Tag(20, "Лошадь", ""),
    ]),
    TagsCategory("location", "Локации", "Описание категории Локации", [
        Tag(21, "Остров", ""),
        Tag(22, "Пещеры", ""),
        Tag(23, "Королевство", ""),
        Tag(24, "Деревня", ""),
        Tag(25, "Замок", ""),
        Tag(26, "Лес", ""),
    ]),
    TagsCategory("genre", "Жанр Истории", "Описание категории Жанр Истории", [
        Tag(27, "Романтика", ""),
        Tag(28, "Новый год", ""),
        Tag(29, "Тайна", ""),
    ]),
]
